# Задание 1
# Напишите функцию, вычисляющую произведение 
# элементов списка целых. Список передаётся в качестве параметра. Полученный результат возвращается изфункции


# def elements(lst):
#  result = 1
#  for num in lst:
#   result *= num
#  return result
# a = [1, 2, 3, 4, 5]
# print(elements(a)) 

# Задание 2

# Напишите функцию для нахождения минимума в 
# списке целых. Список передаётся в качестве параметра. 
# Полученный результат возвращается из функции

# def min_num(a, b, c):
#  if a <= b and a <= c:
#   return a
#  elif b <= a and b <= c:
#   return b
#  else:
#   return c
# print(min_num(10, 5, 15))


# Задание 3 


# Напишите функцию, определяющую количество простых чисел в списке целых. Список передаётся в качестве 
# параметра.Полученныйрезультат возвращается из функции.


# def num(a, b, c):
#  if a <= b and a <= c:
#    return a
#  elif b <= a and b <= c:
#     return b
#  else:
#    return c
# print(num(10, 5, 15,))



# Задание 4 

# Напишите функцию, удаляющую из списка целых 
# некоторое заданное число. Из функции нужно вернуть 
# количество удаленных элементов


# my_list = [10, 20, 30, 40, 30, 50,60, 80, 31, 30]
# for i in range(len(my_list)):
#  if my_list[i] == 30:
#   del my_list[i]
#   break
# print(my_list)  Нужно До Делать!!!!!


# Задание 5
# Напишите функцию, которая получает два списка в 
# качестве параметра и возвращает список, содержащий 
# элементы обоих списков.


# def list(a,b):
#  c = a + b
#  return c 
# a = [1,2,3]
# b = [4,5,6]
# result = (a,b)
# print(result) 


# Задание 6 
# Напишитефункцию, высчитывающуюстепень каждого 
# элемента списка целых. Значение для степени передаётся 
# в качестве параметра, список тоже передаётся в качестве 
# параметра. Функция возвращает новый список, содержащий полученные результаты

# def my_list(a, b):
# result = []
# for number in a:
#   result.append(a ** b)
#   return result
# a = [1,2,3,4]
# b = 2
# print(my_list(a,b)) 
